Revit 2024 API
BuiltInFailures.ArrayFailures.ConstraintsNotSatisfied Property
 Constraints are not satisfied
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ConstraintsNotSatisfied { get; }
Visual Basic
Public Shared ReadOnly Property ConstraintsNotSatisfied As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ConstraintsNotSatisfied {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ArrayFailures Class
Autodesk.Revit.DB Namespace